# Trabalhando com python e Banco de dados

In [3]:
import pandas as pd
import sqlalchemy
import psycopg2

In [2]:
#driver de conexao entre  o python e o sistema de gerenciamento mysql
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 985 kB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

## Engine de conexão ao banco de dados PostgreSQL

- sintaxe:
    - engine =  sqlalchemy.create_engine('mysql+drive://usuario:senha@ip-servidor:porta/banco-de-dados')

In [6]:
#Criando a conexao
engine = sqlalchemy.create_engine('postgresql+psycopg2://postgres:admin@pg_container:5432/dvdrentail')

## Pandas e SQL

### Método: read_sql_table

- table_name: nome da tabela que será conectada
- con: engine de conexão
- schema = Schemma onde a tabela está armazenada. é como se fosse um container e cada banco de dados pode ter várias
- index_col = coluna que será utilizada como indice no banco de dados local

In [9]:
# lendo a tabela actor
actor = pd.read_sql_table('actor', con=engine, columns = [0, 1, 2])
actor.head()

   actor_id first_name     last_name
0         1   Penelope       Guiness
1         2       Nick      Wahlberg
2         3         Ed         Chase
3         4   Jennifer         Davis
4         5     Johnny  Lollobrigida

In [10]:
# lendo a tabela actor
actor = pd.read_sql_table('actor', con=engine, index_col = 'actor_id', columns = [1, 2])
actor.head()

         first_name     last_name
actor_id
1          Penelope       Guiness
2              Nick      Wahlberg
3                Ed         Chase
4          Jennifer         Davis
5            Johnny  Lollobrigida

### Método read_sql_query

Permite fazer todo tipo de query SQL. com SELECT, WERE, GROUP BY, JOIN's, entre outras funcoes. Parâmetros:

- sql = String SQL Query que será executada para retornar os dados
- con = engine de conexão
- index_col = coluna que será utilizada como indice de um data frame
- params = Lista de parametros para serem passados ao método

#### Show all tables names

In [21]:
pd.read_sql_query("""SELECT table_name
                     FROM information_schema.tables
                     WHERE table_schema = 'public'
                     ORDER BY table_name;""", con = engine)

                    table_name
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   inventory
13                    language
14  nicer_but_slower_film_list
15                     payment
16                      rental
17      sales_by_film_category
18              sales_by_store
19                       staff
20                  staff_list
21                       store

#### Read a data frame by a query selector

In [28]:
film_category = pd.read_sql_query(""" SELECT category_id, name
                                    FROM category
                                    ORDER BY name LIMIT 50;""", con =  engine)
film_category.head(10)

   category_id         name
0            1       Action
1            2    Animation
2            3     Children
3            4     Classics
4            5       Comedy
5            6  Documentary
6            7        Drama
7            8       Family
8            9      Foreign
9           10        Games

### Método read_sql

Faz o roteamento entre os métodos read_sql_table e read_sql_query. Ele verifica a melhor forma de executar de forma mais pythonica. mesmo parâmetros dos demais.

In [30]:
pd.read_sql("SELECT * FROM payment LIMIT 5;", con = engine)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,17503,341,2,1520,7.99,2007-02-15 22:25:46.996577
1,17504,341,1,1778,1.99,2007-02-16 17:23:14.996577
2,17505,341,1,1849,7.99,2007-02-16 22:41:45.996577
3,17506,341,2,2829,2.99,2007-02-19 19:39:56.996577
4,17507,341,2,3130,7.99,2007-02-20 17:31:48.996577

## Parâmetros Dinâmicos em Queries

Criaremos condições variáveis para  realizar a query.

In [49]:
query = 'SELECT first_name, last_name ' \
        'FROM  actor ' \
        'WHERE  last_name = %s'

In [50]:
pd.read_sql_query(query, con = engine, params = ["Davis"])

  first_name last_name
0   Jennifer     Davis
1      Susan     Davis
2      Susan     Davis

## Contruindo Dataset no Banco de dados e Inserindo Tabelas

### Criando um dataset no postgres

In [51]:
#criando uma conexao
conn = engine.connect()

In [52]:
#criando o conjunto de dados
conn.execute("commit")
conn.execute("CREATE DATABASE olist;")
conn.close()

In [53]:
#criando engine para o novo banco de dados
#Criando a conexao
new_engine = sqlalchemy.create_engine('postgresql+psycopg2://postgres:admin@pg_container:5432/olist')

In [54]:
#mostrar as tabelas do banco criado
pd.read_sql_query("""SELECT table_name
                     FROM information_schema.tables
                     WHERE table_schema = 'public'
                     ORDER BY table_name;""", con = new_engine)

Empty DataFrame
Columns: [table_name]
Index: []

### Método to_sql

Escreve o datafrma para o formato de banco de dados relacional. Parâmetros:

- name: Nome da tabela que será criada no SGDB;
- con: conexão com o banco de dados. engine;
- schema: Nome do schema onde a tabela será criada;
- if_exists: Comportamento tomado quando a tabela já existe no DB;
    - padrão: nao permite adicionar se já existe;
    - replace: substitui a tabela existente;
    - append: insere a nova tabela abaixo da existente.
- index: Escreve o índice do datafrme como uma coluna da nova tabela;
- index_label = Nome da coluna do índice.

In [55]:
#lê dois arquivos utilizados para fazer o restore da tabela
orders = pd.read_csv("../dataset/olist_orders_dataset.csv")
items = pd.read_csv("../dataset/olist_order_items_dataset.csv")

In [56]:
#Criar a tabela no db
orders.to_sql(name = 'orders', con = new_engine)

In [57]:
#Criar a outra tabela só que sem o índice do dataframe
items.to_sql('items', index=False, con = new_engine)

In [58]:
#vê as tabelas no db
pd.read_sql_query("""SELECT table_name
                     FROM information_schema.tables
                     WHERE table_schema = 'public'
                     ORDER BY table_name;""", con = new_engine)

  table_name
0      items
1     orders

In [60]:
#Lendo a tabela orders no novo db
pd.read_sql("SELECT * FROM orders LIMIT 5", con = new_engine)

,index,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00